{
  "Commit 1":
  [
    "Apagar arquivos desnecessários - deixa só o index.js, e no index.js, troca de App para Cadastro, ou a página que vc for começar a codar",
    "Importar bootstrap (index.html) - https://www.bootstrapcdn.com/",
    "Css basicão: height, overflow-x, font-family, letter-spacing (global.css)",
    "Importar fontes usadas (global.css) - https://fonts.google.com/specimen/Open+Sans",
    "Criei a variavel --primary + .bg-primary",
    "Implementei container-fluid - https://getbootstrap.com/docs/5.0/layout/containers/",
    "Implementei h-100 no index.html + componente cadastro - https://getbootstrap.com/docs/4.0/utilities/sizing/",
    "Implementei col-12 e col-6 - https://getbootstrap.com/docs/4.0/layout/grid/",
    "Implementei form-control - https://getbootstrap.com/docs/4.3/components/forms/",
    "Implementei img-fluid - https://getbootstrap.com/docs/4.0/content/images/",
    "Implementei o input com código padrão do silvio",
    "Implementei o botão do bootstrap e sobreescrevi o estilo dele, pra isso, basta chamar a classe, e estilizar, normal, que ele já sobreescreve."
  ],
  "Commit 2":
  [
    "Criei o componente Produto, este é o produto lista, que vai aparecer no resumo na hora de fechar a venda. Ainda vamos criar o produto que vai aparecer na loja do cliente.",
    "Fiz a estilização do componente produto",
    "No projeto original previa usar o rounded circle do boostrap, mas não funcinou, então fiz na mão este elemento",
    "Criei a página de Checkout, fiz o grid todinho em bootstrap, configurei os inputs",
    "Na estilização da página checkout eu coloquei uma barra de rolagem exclusiva para a lista de produtos que o cliente comprou, dá pra editar essa barra de rolagem depois, fica bem bonito. Eu limitei em 500px a altura do resumo das compras do cliente, não gosto quando o design fica com rolagem na janela principal.",
    "Criei a variável de cor --secondary pra usar em outros lugares do projeto e ganhar tempo",
    "Aviso, o responsivo de todas as páginas eu deixei para o commit final"
  ],
  "Commit 3":
  [
    "Criei o componente ProdutoCard, que são os produtos que vão aparecer para o cliente comprar na loja do marketplace",
    "Fiz a estilização completa do ProdutoCard",
    "Criei a pagina de Petshop, que é como se fosse o site do parceiro que se cadastra na nossa plataforma",
    "Fiz a estilização da pagina Petshop"
  ]
}