{
  "Commit 1":
  [
    "Apagar arquivos desnecessários - deixa só o index.js, e no index.js, troca de App para Cadastro, ou a página que vc for começar a codar",
    "Importar bootstrap (index.html) - https://www.bootstrapcdn.com/",
    "Css basicão: height, overflow-x, font-family, letter-spacing (global.css)",
    "Importar fontes usadas (global.css) - https://fonts.google.com/specimen/Open+Sans",
    "Criei a variavel --primary + .bg-primary",
    "Implementei container-fluid - https://getbootstrap.com/docs/5.0/layout/containers/",
    "Implementei h-100 no index.html + componente cadastro - https://getbootstrap.com/docs/4.0/utilities/sizing/",
    "Implementei col-12 e col-6 - https://getbootstrap.com/docs/4.0/layout/grid/",
    "Implementei form-control - https://getbootstrap.com/docs/4.3/components/forms/",
    "Implementei img-fluid - https://getbootstrap.com/docs/4.0/content/images/",
    "Implementei o input com código padrão do silvio",
    "Implementei o botão do bootstrap e sobreescrevi o estilo dele, pra isso, basta chamar a classe, e estilizar, normal, que ele já sobreescreve."
  ],
  "Commit 2":
  [
    "Criei o componente Produto, este é o produto lista, que vai aparecer no resumo na hora de fechar a venda. Ainda vamos criar o produto que vai aparecer na loja do cliente.",
    "Fiz a estilização do componente produto",
    "No projeto original previa usar o rounded circle do boostrap, mas não funcinou, então fiz na mão este elemento",
    "Criei a página de Checkout, fiz o grid todinho em bootstrap, configurei os inputs",
    "Na estilização da página checkout eu coloquei uma barra de rolagem exclusiva para a lista de produtos que o cliente comprou, dá pra editar essa barra de rolagem depois, fica bem bonito. Eu limitei em 500px a altura do resumo das compras do cliente, não gosto quando o design fica com rolagem na janela principal.",
    "Criei a variável de cor --secondary pra usar em outros lugares do projeto e ganhar tempo",
    "Aviso, o responsivo de todas as páginas eu deixei para o commit final"
  ],
  "Commit 3":
  [
    "Criei o componente ProdutoCard, que são os produtos que vão aparecer para o cliente comprar na loja do marketplace",
    "Fiz a estilização completa do ProdutoCard",
    "Criei a pagina de Petshop, que é como se fosse o site do parceiro que se cadastra na nossa plataforma",
    "Fiz a estilização da pagina Petshop"
  ],
  "Commit 4":
  [
    "Criei o componente sidebar, e implementei ele na minha ui usando o Dock",
    "Criei uma função openDrawer, dentro dela criei um custom event e enviei ele para o navegador",
    "Com o evento customizado criado, eu coloquei o openCart pra ser ativado quando o usuário clicar no botão da sidebar, que o botão de carrinho",
    "No meu componente sidebar criei um useEffect pra ser executado assim que o componente for montado na tela. Ele vai escutar o evento, e se ele escutar o openCart que é novo evento custom, ele vai executar uma função. Essa função basicamente troca o estado da sidebar para ativo, ou seja, clicou no carrinho, vai abrir o modal/drawer",
    "Instalei o dock que é a lib que usamos para gerenciar nosso drawer/sidebar, e fiz as configurações básicas, position right pra ele abrir a partir da direita, gerenciei se ele está visível ou não usando o event handler isVisible, e usei o event handler onVisibleChange, pra caso aconteça uma mudança de visibilidade do componente, ele atualize o estado também.",
    "Configurei para dentro da minha sidebar carregar os produtos que o usuário colocou na cestinha, até então são mocks, pois ainda não tem conexão com backend",
    "Criei um botão que aparece dentro desta sidebar, que é pro usuário finalizar a compra dele",
    "Estilizei a sidebar pra ela aparecer inteirinha em 1 view port, ou seja, pro usuário não ter que scrollar a tela pra ver todos os produtos",
    "Na estilização, adicionei uma formula pra calcular a altura da tela do usuário, e mostrar certinho 100% de altura, e habilita um scroll especial só para a div de cestinha de produtos, assim ele só scrola os itens que tem dentro, se forem muitos. TB configurei para eles aparecer alinhados ao topo (start), pra caso tenham poucos itens eles fiquem alinhados ao inicio.",
    "Fiz a estilização do botão de abrir a sidebar",
    "alinhei o botão laranja que fica dentro do component Product, o botão que fica ao lado de cada produto, ele estava alinhado start, e eu alinhei ele ao centro na vertical usando margin auto 0",
    "Implementei a sidebar no index.js principal da aplicação, para que o botão de carrinho possa abrir o modal/drawer em várias telas diferentes.",
    "Configuramos os momentos onde queremos que o botão de carrinho seja mostrado. Na tela de checkout e na tela de cadastro não faz sentido aparecer o botão de ver o carrinho, então através de props/atributos a gente passou hideCart, e quando este hideCart estiver presente, o botão de abrir carrinho não vai aparecer. A gente passa esta props para o header, e ela desativa o button dentro do arquivo dela mesmo. "
  ],
  "Commit 5":
  [
    "Implementei a lib Google Map React, essa lib a gente instala com yarn add google-map-react, e eu coloquei esse map como background para a home, para depois eu colocar markers mostrando no mapa as lojas parceiras",
    "Criei um componente marker e coloquei ele dentro da minha tag do Google Map React, desta forma, a gente passa latitude e longitude no marker, e ele vai ficar posicionado certinho no mapa.",
    "Estilizei o componente marker pra ele ser uma imagem svg de pin, coloquei img fluid nele, e coloquei um atributo de img src nele, pra que o marker mostre o logo do parceiro no mapa.",
    "Estilizei o componente marker pra ele ter um estado de ativo, que é quando o usuário clicar nele, pra ele ficar na cor primary, que é aquele verde",
    "Posicionei o img do marker de forma absolute , deixei ele redondinho para ele encaixar dentro do svg de marker em branco que a gente importou nele, fazemos isso justamente para que o logo do parceiro sobreponha o svg em branco que vem dentro dele, se não ele se comportaria inline ou block, e não é o que a gente quer",
    "Estilizei o container de map para ele ficar com 100% do tamanho, subtraindo os 94px do header, dessa forma fica tudo em uma viewport só, e não cria overflow",
    "Criei também a listagem de parceiros da pagina home, que vai mostrar as informações do parceiro, a distancia, a avaliação, se ele oferece frete grátis.",
    "Estilizei a home onde mostra os parceiros, para listar os parceiros e criar um overflow-x , que é a barra de rolagem na horizontal. Essa barra de rolagem vai ser ativada apenas para a div dos parceiros, e não no window/janela do navegador, isso cria um efeito muito legal, e depois a gente ainda consegue estilizar essa barra de rolagem. ",
    "Estilizei o container de listagem de parceiros para ele ficar por cima do Google map react que a gente configurou de background.",
    "Configurei as rotas do projeto, usando a lib react-router-dom.",
    "Coloquei um <Link /> no meu header, pra quando o usuário clicar no logo do site, ele ser redirecionado para a home path /"
  ],
  "Commit 6 (parte 3)":
  [
    "Corrigi o bug que o mapa não aparecia de fundo, bastou adicionar um style width+height de 100% que resolveu. e adicionei minha api key ao projeto, agora o google map react está funcionando.",
    "Feature: Quando o usuário clica(onClick) no marker do google maps, agora o marker fica verde se o usuário tiver clicado nele.(troco o src do img usando lógica e state)",
    "Adicionei redux no projeto - yarn add redux react-redux",
    "Adicionei a extensão do redux dev tools no google chrome",
    "Instalei o redux dev tools extension no projeto - yarn add redux-devtools-extension",
    "Adicionei o immer para garantir imutabilidade JS, é uma boa prática usar immer junto com redux.",
    "Implementação: Finalizei toda a implementação do redux no nosso projeto, e coloquei nossa primeira action(SET_CUSTOMER)",
    "Boas Práticas: Criei os arqivos actions e types para chamar nossas actions de forma dinâmica",
    "Boas Práticas: Renomeei o set_customer como @shop/set_customer para seguir a boa prática, que determina que o nome da action seja @nomeDoMódulo/nomeDaAction"
  ],
  "Commit 7":
  [
   "Quando eu desenvolvo uma aplicação com react + node + mongo, como eu inicio todos os ambientes para o projeto rodar de forma local? Primeiro precisa startar a banco de dados: sudo systemctl start mongod, depois precisa ver se o banco realmente está UP sudo systemctl status mongod, aí a api vai consumir do mongo, então inicia a api. Navega pelo terminal até a pasta api, no nosso caso é cd api, e depois yarn start. 3- E agora, vamos startar nosso front end, que vai consumir da api, ai fazemos cd web, yarn start. Pronto agora vc tá rodando tudo de forma local. (react+node+mongo)",
   "Redux: Gerenciar estado do componente Marker",
   "Consumindo estado do Redux no Front - Troquei os dados estáticos das petshops pelo dado dinâmico da store do redux",
   "Fiz a configuração completa do redux saga, neste use case vamos buscar dados do mongoDB.",
   "Implementei IMMER.JS para garantir imutabilidade no meu reducer."
  ],
  "Commit 8":
  [
    "(Redux - MARKER) Removemos o controle de estado do componente marker, que estava sendo realizado pelo hook useState, e passamos a gerenciar o estado dele através do redux. ",
    "(Redux) Realizamos toda a configuração da petshop selecionada, para controlar o estado de quando o usuário clicar em uma loja parceira",
    "(CSS) Estilizamos a petshop clicada, pra aparecer na lista uma borda verde embaixo, pro usuário saber qual delas está selecionada. Assim como configuramos um hover, com o mesmo efeito.",
    "(Redux Saga/Router Dom - PETSHOP QUERY) Para a api saber qual petshop queremos carregar, enviamos o ID da petshop clicada no mapa/lista por req.params. No caso do <Link> o nome é match.params.id, que é passado como props por padrão, nem precisamos criar. Atualizamos o componente para ele estar preparado para receber esta props do front, e o id é enviado para nosso redux saga realizar a consulta no mongoDB",
    "(Redux Saga - PETSHOP QUERY) Quando clicamos na petshop no mapa, abre a pagina da petshop parceira. Substituimos os produtos de mock da loja parceira pelos produtos reais do DB. No redux saga configuramos a request, e depois no reducer, atualizamos o estado do objeto PETSHOP. Dentro do objeto petshop tem petshop.products, que são os produtos que o parceiro possui à venda. Nesta etapa encontramos um bug. O front end estava carregando a dom, antes do redux saga retornar os dados da api, e estava dando objeto undefined na petshop.products. Coloquei o optional chaining, que permite o objeto ser undefined sem dar crash, e aí, ele passou a carregar a tela e os dados da api chegavam e preenchiam certinho a loja do parceiro com todos os produtos a venda",
    "(Redux/front - PETSHOP QUERY) Substituimos os dados de produto de mock por produtos reais que vieram no objeto petshop, que o redux saga chamou da api",
    "(Redux - PETSHOP QUERY) Criamos a action requestPetshop(id), que recebe o id da petshop que é pra buscar. Esse id vem do <Link>, passa por props para o componente, e o componente da dispatch na action passando este id como parâmetro da action lá no front.",
    "(Redux - PETSHOP QUERY) Criamos a action setPetshop(petshop), que recebe o objeto petshop. Essa action setPetshop é chamada dentro do nosso redux saga. Basicamente é assim, o redux saga dá a requestPetshop pra puxar os dados, e depois da um yield pra retornar os valores pra action setPetshop. A setPetshop vai atualizaar o estado inicial do objeto petshop, então a requestPetshop apenas dá um get nos dados da api.",
    "(Redux - PETSHOP QUERY) Queremos que a requisição get dos produtos da petshop seja realizada assim que o componente for montado na tela, pra isso, colocarmos o dispatch dentro do useEffect com dependências vazias. 1-O front dispara o redux saga. 2-No finalzinho do saga, ele ativa o setPetshop(atualizando a listagem de produtos daquela petshop parceira). 3-No front, para usarmos este valor, a gente busca ele da nossa store, usando o useSelector. 4-Pronto, agora podemos acessar os valores atualizados do objeto petshop.",
    {
      "Cart":
      [
      "Precisamos verificar se o produto existe dentro do carrinho, para saber se vamos adicionar ou remover.",
      "Nosso carrinho é uma array. Arrays possuem posições/index.", 
      "Quero executar uma lógica e salvar o resultado dela na variável index, pra depois eu verificar o que eu farei com a ação do usuário (se vai adicionar ou remover do carrinho)",
      "No index ficará salvo o resultado de: Existe algum produto no meu carrinho que tem o mesmo ID que o produto que eu acabei de clicar? Salve o resultado desta lógica na variavel index.",
      "Se o index for diferente de -1, ou seja, se ele existir, faça o seguinte: percorra a array a partir do item encontrado, e exclua 1 item a partir dele, ou seja, somente ele mesmo.",
      "Caso contrário (o produto não exista), utilize o método push (que adiciona registros em array), e pegue o produto que foi clicado e adicione na array do carrinho.",
      "Substituimos os produtos de mock que estavam sendo usados no carrinho por produtos reais"
      ]
    }
  ],
  "Commit 9":
  [
    {
    "Checkout":
      [
      "(router-dom) O cliente terminou de adicionar tudo que ele queria na sacola, e agora ele clica em finalizar compra.",
      "(router-dom) Ele precisa ser redirecionado para a pagina de checkout. Usamos o hook useHistory do react-router-dom + Colocamos a sidebar dentro das chaves do <Router> ou <BrowserRouter>, para que ele seja capaz de ativar o useHIstory no evento de clique(onClick)",
      "(Redux) Puxamos o objeto cart com useSelector ",
      "(Redux/Front) Renderizamos o resumo do pedido usando map no objeto cart que puxamos do redux, dessa forma, ele tem de um lado os dados de pgto, e do outro, os itens que ele está comprando pra visualizar.",
      "(Objeto Transaction/useState) Importamos o useState para começarmos a montar nosso objeto TRANSACTION. Este objeto será enviado para o endpoint do pagarme quando ele estiver com todos os dados tratados bonitinhos. ",
      "(Objeto Transaction/useState) Copiamos da documentação ou do insomnia o modelo JSON de como o endpoint do pagarme espera receber os dados. A gente precisa enviar os dados exatamente como o endpoint espera receber para não dar erros.",
      "(Objeto Transaction/useState) Instalo a lib dayjs + Implemento a lib na linha delivery_date. Inicializo o dayjs. Entrega será em 7 dias, e formato para a data aparecer no formato de ano/mês/dia",
      "(Objeto Transaction/Formulario Entrega) Crio a função setShippingValue. Essa função vai atualizar o estado do objeto transaction.; Ela vai pegar tudo de transaction, e vai alterar o shipping + address; Essa função ela recebe uma key, e um value. Criamos estes placeholder pra receber os dados dos nossos formulários.; Lá no formulário, a cada onChange, será chamada essa função, e a gente vai passar, por ex, o cep é a chave/key, e o valor/value é o que o usuário digitar (e.target.value)",
      "(Objeto Transaction/Formulario Entrega) Passo a key que será o zipcode, e o value, que será o que o usuário digitar, desta forma, a gente atualiza o estado do objeto transaction, nas keys e values de endereço.; Cada campo do formulário será atualizado desta mesma forma.",
      "(Objeto Transaction/Formulario Dados de PGTO) A partir daqui fica diferente pra atualizar o estado.; A função setShippingValue só se aplica nos endereços.; Nos campos do formulário de dados de pgto a gente vai atualizar direto usando o useState mesmo; A gente pega tudo o que vier do objeto transaction, copia (...transaction) e atualiza somente o campo do objeto que é equivalente a este campo aqui do formulário.; O valor que vai ficar em card_number por ex, é o valor que o usuário digitar. o e é de evento. É assim que a gente pega o que o usuário digitou.",
      "(Objeto Transaction/Formulario Dados de PGTO) O pagar me exige o nome do cartão lá no endpoint de post deles (pra enviar a transação); A gente não tinha planejado pedir o nome que consta no cartão do cliente, então fizemos isso agora.",
      "(Objeto Transaction/makePurchase(): Criamos a função makePurchase, essa função por enquanto vai ter apenas um console.log dentro dela.; Desta forma a gente consegue ver o JSON final que vamos enviar para o pagarme.; A gente coda, compara com a documentação do pagarme, até ficar igual, e depois disso, podemos realizar testes sandbox.;Quando chegarmos nessa etapa, ai vamos de fato enviar este json para o endpoint do pagarme para ele fazer uma transação fictícia.",
      "[Objeto Transaction/makePurchase()/Button]: Implementamos a função makePurchase temporariamente no button, para que quando a gente clique em finalizar compra, possamos inspecionar no console como estão formatados os dados do objeto transaction. O objetivo é deixar ele igual ao formato de dados que o pagarme espera receber no endpoint de CREATE TRANSACTION.",
      "(Objeto Transaction/useEffect[total]: Nosso objeto transaction já está quase pronto pra ser enviado para o pagarme.; Neste momento a gente quer preencher os itens que o cliente comprou + valor total do pedido(assim que o componente for renderizado+toda vez que a variavel total for alterada); Para isso criamos nossa lógica, e colocamos dentro da dependência a variável total. Desta forma toda vez que a variável total mudar, o useEffect vai ser executado novamente.",
      "(Objeto Cart/Variavel Total): Vamos somar o valor total da compra do cliente, para podermos atualizar no campo amount da requisição que enviaremos ao pagarme.",
      "(Objeto Transaction/useEffect/Campo amount: Atualizar valor total da compra(campo amount); É importante sempre consultar como o endpoint de post espera receber um dado.; O endpoint do pagarme espera que o campo amount seja postado sem virgula nem ponto, então a gente efetuou o tratamento dos dados na hora de enviar os dados. ",
      "(Objeto Transaction/useEffect/Campo items: Atualizar sacola do cliente(campo items); O endpoint do pagarme tem uma forma como ele espera receber os dados.; A gente consulta a requisição de exemplo, copia ela, e cola aqui dentro do objeto items.; Mapeamos cada campo conforme o dado dinâmico. Neste caso temos vários produtos na sacola, então a gente executa um map, e cada item iterado preenche os dados do objeto item. Por ex product._id, vai preencher o objeto items no campo product._id. Preenchemos cada dado do nosso projeto, que seja equivalente ao dado que o pagarme espera.; No unit price a gente trata da mesma forma que o amount, porque na documentação do pagarme, diz que ele não pode conter pontos nem virgulas.;O quantity é um campo que por enquanto não respeita um use case real, porque uma pessoa precisa ter a opção de comprar mais de 1 do mesmo produto, então a gente precisa configurar isso mais tarde.",
      "(Bootstrap): Nossos formulário estavam usando classes do boostrap 4 (pl-0). O objetivo era zerar o padding left. Consultei a documentação do bootstrap, e troquei por pl-0, que é o jeito atualizado de remover padding left."
    ]
    }
  ]
}




