{
  "PetFood - Parte 1" : 
  {
    "Mudei meu código mas no emulador continua aparecendo a versão anterior do código, o que eu faço?": "Isso acontece por causa do cache. Aperta ctrl+shift+r ao invés de F5 que vai atualizar certinho",
    "O que faz a classe mb do bootstrap?": "Só mexe no margin-bottom mesmo, mais nada. - https://stackoverflow.com/questions/51832083/how-to-understand-mb-5-class-attribute-in-bootstrap/51832522",
    "Quais são as opções de espaçamento que o bootstrap dá?": "A sintaxe não é mb-pixels, entenda mais no link. - https://getbootstrap.com/docs/5.0/utilities/spacing/"
  },
  "Petfood - Parte 2":
  {
    "Quero colocar estrela, home e outros icones no meu projeto, como eu faço?": "Usa material design icons, instala com npm/yarn ou importa pelo css no arquivo index.html do seu projeto react. - Fonte: https://dev.materialdesignicons.com/getting-started/webfont",
    "Quero converter meu hexadecimal para rgb, onde eu vou?": "https://www.rapidtables.com/convert/color/hex-to-rgb.html",
    "Componente de sidebar para react": "https://github.com/alexkuz/react-dock",
    "Quais são os event handlers do react?": "https://flaviocopes.com/react-events/",
    "Onde devem ficar as funções disparadas por um event handler?": "Uma função que é disparada quando seu componente é clicado (onClick) deve estar escrita antes do return, dentro do seu componente react.",
    "Qual o benefício de sabermos usar mais event handlers?":"Podemos mostrar uma mensagem depois que o usuário clicar pra copiar um conteúdo (onCopy), podemos mostrar um texto de ajuda pro usuário preencher um formulário(onInput). Quanto mais conhecermos os event handlers, mais nossa UI será gostosa de se usar, pois o planejamento de UX levará em consideração todos os eventos possíveis.",
    "Como alinhar um item sem flexbox?": "Alinhar na vertical:   margin: auto 0; Alinhar na horizontal é margin: 0 auto"
  },
  "Petfood - Parte 3":
  {
    "Como colocar o google maps no meu web app react?":"https://github.com/google-map-react/google-map-react",
    "Como colocar pins no meu google maps pra representar por ex as lojas parceiras?":"Usando markers, olha bem este código que fizemos, a gente tem o componente marker, e a gente usa ele dentro do google map react, a gente passa o lat e o lng como parametros dele, e o pointer fica certo",
    "Como colocar rotas e links no meu react app?":"https://reactrouter.com/web/guides/quick-start"
  },
  "Petfood - Parte 4":
  {
    "Qual o link pra gerenciar minhas api keys do google maps?":"https://console.cloud.google.com/google/maps-apis/credentials?project=graphite-store-322905&supportedpurview=project",
    "Meu google maps não carrega na aplicação, o que pode ser?":"O google maps exige um width e um height determinados no style da div que ele estiver, sem isso, ele não funciona"
  },
  "Petfood - Parte 5":
  {
    "Qual o passo a passo para o setup do redux no nosso projeto?":"Terminal: yarn add redux react-redux + yarn add redux-devtools-extension (https://github.com/zalmoxisus/redux-devtools-extension), o redux devtools extension precisa ser implementado dentro da sua store com a seguinte linha que está na documentação do github: window.__REDUX_DEVTOOLS_EXTENSION__ && window.__REDUX_DEVTOOLS_EXTENSION__() + extensão google chrome redux dev tools(https://chrome.google.com/webstore/detail/redux-devtools/lmhkpmbekcpmknklioeibfkpmmfibljd?hl=pt-BR), adiciona o immer(biblioteca de imutabilidade para JS) yarn add immer",
    "Como adicionar um item para o gitignore?":"ABre o github desktop, botão direito no arquivo que vc quer ignorar, ignore-file(add to git ignore)"
  },
  "Petfood - Parte 6":
  {
    "Como fazer consulta api usando redux?":"Precisa usar o redux-saga, ele é um middleware, ele intercepta as actions que a gente dispara, ele faz as requisições por ex, executa algo asincrono(ou seja, que precisa aguardar uma resposta) e aí sim devolve uma resposta ao nosso reducer.",
    "Posso usar o axios no front e no back?":"Sim, aí instala em ambos os projetos, na pasta do projeto frontend, neste caso é a pasta web, e na pasta do projeto backend, que neste caso é a pasta api"
  }
}